<!--
 * @Date: 2022-05-25 15:24:13
 * @LastEditors: 刘国亮
 * @LastEditTime: 2022-06-06 17:22:01
 * @FilePath: \little-bee-mobile\src\views\agreement\payment.vue
 * @Description: 
-->
<template>
  <div class="agree">
    <bread></bread>
    <div class="text"
         v-html="text"></div>
  </div>
</template>

<script>
import Bread from '@/components/bread/index'
export default {
  name: 'payment',
  components: {
    Bread
  },
  data() {
    return {
      text: `【小蜜蜂123】系统充值用户告知书

本告知书为北京厚鸟科技有限公司关于【 小蜜蜂123】系统的充值使用条款，您在充值之前，请务必仔细查阅本告知书，您在充值任意款项后，视为您接受以下条款。本公司在法律许可的范围内享有对本告知书进行解释、修订及变更的权利；
一、账号使用规则
1、在平台上使用上服务过程中，您承诺遵守以下约定：
（1）在使用平台服务过程中实施的所有行为均遵守国家法律、法规等规范性文件及平台各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保平台免于因此产生任何损失。
（2）在交易过程中，遵守诚实信用原则，不采取不正当交易行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。
（3）不对平台上的任何数据作商业性利用，包括但不限于在未经公司事先书面同意的情况下，以复制、传播等任何方式使用平台站上展示的资料。
（4）不使用任何装置、软件或例行程序干预或试图干预平台的正常运作或正在成平台上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸平台网络设备的行动。
（5）您了解并同意：
a.平台有权对您是否违反上述承诺做出单方认定，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。
b.基于维护平台交易秩序及交易安全的需要，公司有权在发生恶意购买等扰乱平台市场正常交易秩序的情形下，执行取消特殊用户资格等操作。
c.经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者平台根据自身的判断，认为您的行为涉嫌违反本协议或规则的条款或涉嫌违反法律法规的规定的，则公司有权在平台上对您的该等涉嫌违法或违约行为进行公开的风险预警并公开公司已对您采取的措施。
d.对于您在平台上实施的行为，包括您未在平台上实施但已经对平台及其用户产生影响的行为，平台有权单方认定您行为的性质及是否构成对本协议或规则的违反，并据此作出相应处罚。您应自行保存与您行为有关的全部证据以备申诉之需要，并应对无法提供充要证据而承担不利后果。
e.对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保平台免于因此产生损失或增加费用。
f.如您涉嫌违反有关法律或者本协议之规定，使平台遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿由此给平台造成的损失及（或）发生的费用，包括但不限于案件受理费，保全费、保单保函，律师代理费等相关诉讼费用。
（6）本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：
 1、不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；
2、从中国大陆向境外传输资料信息时必须符合中国有关法规；
3、利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；
4、干扰本站的正常运转，不得侵入本站及国家计算机信息系统；
5、传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；
6、传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；
7、教唆他人从事本条所禁止的行为；
8、利用在本站注册的账户进行牟利性经营活动；
9、发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；
10、不时关注并遵守本站不时公布或修改的各类合法规则规定。
11、有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。
   若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。
二、充值声明
（1）顾客应加强自我保护，提高防范意识，由于您对账户信息、手机号码等个人信息等保管不善或告知他人而导致的任何财产损失，因此产生的责任以及纠纷皆有您自行承担，本公司不负任何责任。
（2）本公司承诺保障顾客个人隐私安全，原则上不向任何个人或组织泄露用户个人信息，但当司法机关、监管机构或其他政府部门依据法律程序，要求提供您的个人信息时，本公司将及时通知顾客，根据相关部门的要求提供您的相关信息资料。
（3）对于任何本公司无法控制的原因（包括但不限于黑客攻击、计算机病毒攻击、政府管制、通讯设施故障及其他不可抗力因素）导致的暂停运营、顾客信息泄露、被盗用、被篡改等非正常经营行为，本公司不承担任何责任。
`
    }
  }
}
</script>

<style scoped lang="less">
.agree {
  .text {
    height: calc(100vh - 36px);
    overflow-y: scroll;
    padding: 15px;
    font-family: Source Han Sans CN;
    font-weight: bold;
    color: #666666;
    line-height: 19px;
    font-size: 13px;
  }
}
</style>